Core/src/Catalogs/AzRytmpНоменклатурныеГруппы/AzRytmpНоменклатурныеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AzRytmpНоменклатурныеГруппы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновнаяГруппа</name>
      <description>Основная группа</description>
    </items>
  </predefined>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Справочник_Номенклатура</name>
      <description>Номенклатура</description>
    </items>
    <items>
      <name>Справочник_ХарактеристикиНоменклатуры</name>
      <description>Характеристики номенклатуры</description>
    </items>
    <items>
      <name>Документ_АвансовыйОтчет</name>
      <description>Авансовый отчет</description>
    </items>
    <items>
      <name>Документ_АктВыполненныхРабот</name>
      <description>Акт выполненных работ</description>
    </items>
    <items>
      <name>Справочник_ВнешниеПользователи</name>
      <description>Внешние пользователи</description>
    </items>
    <items>
      <name>Документ_ДоговорКредитаИЗайма</name>
      <description>Договор кредита и займа</description>
    </items>
    <items>
      <name>Справочник_ДоговорыКонтрагентов</name>
      <description>Договоры контрагентов</description>
    </items>
    <items>
      <name>Документ_ПриемИПередачаВРемонт</name>
      <description>Документ прием и передача в ремонт</description>
    </items>
    <items>
      <name>Документ_СборкаЗапасов</name>
      <description>Документ сборка запасов</description>
    </items>
    <items>
      <name>Документ_ЗаданиеНаРаботу</name>
      <description>Задание на работу</description>
    </items>
    <items>
      <name>Документ_ЗаказНаПроизводство</name>
      <description>Заказ на производство</description>
    </items>
    <items>
      <name>Документ_ЗаказПокупателя</name>
      <description>Заказ покупателя</description>
    </items>
    <items>
      <name>Документ_ЗаказПоставщику</name>
      <description>Заказ поставщику</description>
    </items>
    <items>
      <name>Документ_РасходДСПлан</name>
      <description>Заявка на расход денег</description>
    </items>
    <items>
      <name>Справочник_ВнеоборотныеАктивы</name>
      <description>Имущество</description>
    </items>
    <items>
      <name>Справочник_КонтактныеЛица</name>
      <description>Контактные лица</description>
    </items>
    <items>
      <name>Справочник_Контрагенты</name>
      <description>Контрагенты</description>
    </items>
    <items>
      <name>Документ_КорректировкаПоступления</name>
      <description>Корректировка поступления</description>
    </items>
    <items>
      <name>Документ_КорректировкаРеализации</name>
      <description>Корректировка реализации</description>
    </items>
    <items>
      <name>Документ_НачисленияПоКредитамИЗаймам</name>
      <description>Начисления по кредитам и займам</description>
    </items>
    <items>
      <name>Справочник_НоменклатураПоставщиков</name>
      <description>Номенклатура поставщиков</description>
    </items>
    <items>
      <name>Документ_ОперацияПоПлатежнымКартам</name>
      <description>Операция по платежным картам</description>
    </items>
    <items>
      <name>Документ_ОприходованиеЗапасов</name>
      <description>Оприходование запасов</description>
    </items>
    <items>
      <name>Справочник_Организации</name>
      <description>Организации</description>
    </items>
    <items>
      <name>Документ_ОтчетОРозничныхПродажах</name>
      <description>Отчет о розничных продажах</description>
    </items>
    <items>
      <name>Справочник_ПапкиФайлов</name>
      <description>Папки файлов</description>
    </items>
    <items>
      <name>Справочник_ПартииНоменклатуры</name>
      <description>Партии номенклатуры</description>
    </items>
    <items>
      <name>Документ_ПеремещениеДС</name>
      <description>Перемещение денег</description>
    </items>
    <items>
      <name>Документ_ПеремещениеЗапасов</name>
      <description>Перемещение запасов</description>
    </items>
    <items>
      <name>Справочник_Пользователи</name>
      <description>Пользователи</description>
    </items>
    <items>
      <name>Документ_ПоступлениеВКассу</name>
      <description>Поступление в кассу</description>
    </items>
    <items>
      <name>Документ_ПоступлениеНаСчет</name>
      <description>Поступление на счет</description>
    </items>
    <items>
      <name>Документ_ПриходнаяНакладная</name>
      <description>Приходная накладная</description>
    </items>
    <items>
      <name>Документ_ПриходныйОрдер</name>
      <description>Приходный ордер</description>
    </items>
    <items>
      <name>Справочник_Проекты</name>
      <description>Проекты</description>
    </items>
    <items>
      <name>Документ_РасходИзКассы</name>
      <description>Расход из кассы</description>
    </items>
    <items>
      <name>Документ_РасходСоСчета</name>
      <description>Расход со счета</description>
    </items>
    <items>
      <name>Документ_РасходнаяНакладная</name>
      <description>Расходная накладная</description>
    </items>
    <items>
      <name>Документ_РасходныйОрдер</name>
      <description>Расходный ордер</description>
    </items>
    <items>
      <name>Справочник_СерийныеНомера</name>
      <description>Серийные номера</description>
    </items>
    <items>
      <name>Документ_Событие</name>
      <description>Событие</description>
    </items>
    <items>
      <name>Документ_СписаниеЗапасов</name>
      <description>Списание запасов</description>
    </items>
    <items>
      <name>Справочник_СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи движения денежных средств</description>
    </items>
    <items>
      <name>Справочник_СтруктурныеЕдиницы</name>
      <description>Структурные единицы</description>
    </items>
    <items>
      <name>Документ_СчетНаОплату</name>
      <description>Счет на оплату</description>
    </items>
    <items>
      <name>Документ_СчетНаОплатуПоставщика</name>
      <description>Счет на оплату поставщика</description>
    </items>
    <items>
      <name>Справочник_ТранспортныеСредства</name>
      <description>Транспортные средства</description>
    </items>
    <items>
      <name>Справочник_Файлы</name>
      <description>Файлы</description>
    </items>
    <items>
      <name>Справочник_ФизическиеЛица</name>
      <description>Физические лица</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСведений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСведения</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/AzRytmpНоменклатурныеГруппы/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
		
	Если НЕ Отказ Тогда
		
		Если НЕ ЗначениеЗаполнено(НаборСвойствХарактеристики) Тогда
			ОбъектНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.СоздатьЭлемент();
		Иначе
			ОбъектНабора = НаборСвойствХарактеристики.ПолучитьОбъект();
			ЗаблокироватьДанныеДляРедактирования(ОбъектНабора.Ссылка);
		КонецЕсли;

		ОбъектНабора.Наименование    = Наименование;
		ОбъектНабора.Родитель        = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ХарактеристикиНоменклатуры;
		ОбъектНабора.ПометкаУдаления = ПометкаУдаления;
		ОбъектНабора.Записать();
		НаборСвойствХарактеристики = ОбъектНабора.Ссылка;
		
	КонецЕсли;	
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриКопировании.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	НаборСвойствХарактеристики = Неопределено;
	
КонецПроцедуры // ПриКопировании()
